In [1]:
import pandas as ps
import numpy as nm

In [40]:
# q1.
w1=[[1,'qw','fc','north','qw@gmail.com','dl'],[2,'yt','rt','west','gv@gmail.com','j&k'],[3,'fv','jy','east','qs@gamil.com','mp']]
ps.DataFrame(w1,index=['a','b','c'],columns=['num','alpha','fname','reigon','mail','st code'])

   num alpha fname reigon          mail st code
a    1    qw    fc  north  qw@gmail.com      dl
b    2    yt    rt   west  gv@gmail.com     j&k
c    3    fv    jy   east  qs@gamil.com      mp

In [39]:
# q2.
w2={'sr no':['1','2','3','4'],'name':['jay','dhruvi','sankar','jiva']}
w3=ps.DataFrame(w2)
w3.transpose() # or w3.T

         0       1       2     3
sr no    1       2       3     4
name   jay  dhruvi  sankar  jiva

In [41]:
# q3.
w4=[[1,2],['sd','ji']]
ps.DataFrame(w4,columns=['digit','char'])

  digit char
0     1    2
1    sd   ji

In [50]:
# q4.
w5=[('jay',7),('dhruvi',4),('sankar',41),('jiva',32)]
ps.DataFrame(w5,columns=['name','age'])

     name  age
0     jay    7
1  dhruvi    4
2  sankar   41
3    jiva   32

In [52]:
# q5. to create series using pandas & dictonary
w6={'t':4.2,'e':9.1,'r':3.,'l':7.9}
ps.Series(w6)

t    4.2
e    9.1
r    3.0
l    7.9
dtype: float64

In [56]:
# q6.
ps.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [1]:
import pandas as pa
import numpy as ny

In [8]:
q=ny.random.randn(335)
w=pa.DataFrame(q,columns=['hunger index'],index=pa.date_range('07/20/2022',periods=335))

In [9]:
w

            hunger index
2022-07-20     -0.765892
2022-07-21      2.618129
2022-07-22      0.049817
2022-07-23     -0.826579
2022-07-24     -0.961735
...                  ...
2023-06-15     -0.821167
2023-06-16     -0.048274
2023-06-17      0.430607
2023-06-18      1.454367
2023-06-19      1.416206

[335 rows x 1 columns]